rushairer/LearnCW32/Libraries/inc/cw32f030_gpio.h
#ifndef __CW32F03x_GPIO_H__
#define __CW32F03x_GPIO_H__

#ifdef __cplusplus
extern "C"
{
#endif

/*****************************************************************************/
/* Include files                                                             */
/*****************************************************************************/

#include "base_types.h"
#include "cw32f030.h"

/*****************************************************************************/
/* Global pre-processor symbols/macros ('#define')                           */
/*****************************************************************************/

typedef struct
{
    uint32_t Pins;
    uint32_t Mode;
    uint32_t IT;
    uint32_t Speed;
} GPIO_InitTypeDef;

typedef enum
{
    GPIO_Pin_RESET = 0,
    GPIO_Pin_SET
} GPIO_PinState;

//============================================================

void GPIO_SWD2GPIO(void);
void GPIO_GPIO2SWD(void);
void GPIO_LockPin(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pins);
void GPIO_DeInit(GPIO_TypeDef *GPIOx, uint32_t GPIO_Pins);
void GPIO_Init(GPIO_TypeDef *GPIOx, GPIO_InitTypeDef *GPIO_Init);
void GPIO_ConfigFilter(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pins, uint32_t FltClk);
void GPIO_WritePin(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pins, GPIO_PinState PinState);
void GPIO_HighByte_Write(GPIO_TypeDef *GPIOx, uint8_t Value);
void GPIO_LowByte_Write(GPIO_TypeDef *GPIOx, uint8_t Value);
void GPIO_TogglePin(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pins);
GPIO_PinState GPIO_ReadPin(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin);

//============================================================

#define GPIO_MODE_ANALOG                        (0X00)
#define GPIO_MODE_INPUT                         (0x10)
#define GPIO_MODE_INPUT_PULLUP                  (0x11)
#define GPIO_MODE_INPUT_PULLDOWN                (0x12)
#define GPIO_MODE_OUTPUT_PP                     (0x20)
#define GPIO_MODE_OUTPUT_OD                     (0x21)

#define GPIO_IT_NONE                            (0x80)
#define GPIO_IT_RISING                          (0x81)
#define GPIO_IT_FALLING                         (0x82)
#define GPIO_IT_HIGH                            (0x84)
#define GPIO_IT_LOW                             (0x88)

#define GPIO_SPEED_LOW                          (0x0000)
#define GPIO_SPEED_HIGH                         (0xFFFF)

//============================================================

#define GPIO_PIN_0                              ((uint16_t)0x0001)   /* Pin 0    selected */
#define GPIO_PIN_1                              ((uint16_t)0x0002)   /* Pin 1    selected */
#define GPIO_PIN_2                              ((uint16_t)0x0004)   /* Pin 2    selected */
#define GPIO_PIN_3                              ((uint16_t)0x0008)   /* Pin 3    selected */
#define GPIO_PIN_4                              ((uint16_t)0x0010)   /* Pin 4    selected */
#define GPIO_PIN_5                              ((uint16_t)0x0020)   /* Pin 5    selected */
#define GPIO_PIN_6                              ((uint16_t)0x0040)   /* Pin 6    selected */
#define GPIO_PIN_7                              ((uint16_t)0x0080)   /* Pin 7    selected */
#define GPIO_PIN_8                              ((uint16_t)0x0100)   /* Pin 8    selected */
#define GPIO_PIN_9                              ((uint16_t)0x0200)   /* Pin 9    selected */
#define GPIO_PIN_10                             ((uint16_t)0x0400)   /* Pin 10   selected */
#define GPIO_PIN_11                             ((uint16_t)0x0800)   /* Pin 11   selected */
#define GPIO_PIN_12                             ((uint16_t)0x1000)   /* Pin 12   selected */
#define GPIO_PIN_13                             ((uint16_t)0x2000)   /* Pin 13   selected */
#define GPIO_PIN_14                             ((uint16_t)0x4000)   /* Pin 14   selected */
#define GPIO_PIN_15                             ((uint16_t)0x8000)   /* Pin 15   selected */
#define GPIO_PIN_All                            ((uint16_t)0xFFFF)   /* All pins selected */

//============================================================
//端口滤波定义
#define GPIO_FLTCLK_HCLK2                       (((uint32_t)0) << 16)
#define GPIO_FLTCLK_HCLK4                       (((uint32_t)1) << 16)
#define GPIO_FLTCLK_HCLK8                       (((uint32_t)2) << 16)
#define GPIO_FLTCLK_BTIM1OV                     (((uint32_t)3) << 16)
#define GPIO_FLTCLK_RC150K                      (((uint32_t)4) << 16)
#define GPIO_FLTCLK_LSI                         (((uint32_t)5) << 16)
#define GPIO_FLTCLK_RC10K                       (((uint32_t)6) << 16)

//============================================================
//清除CW_GPIO中断标志
#define GPIOA_INTFLAG_CLR(Mask)                 ((CW_GPIOA->ICR) = (~((uint32_t)(Mask))))
#define GPIOB_INTFLAG_CLR(Mask)                 ((CW_GPIOB->ICR) = (~((uint32_t)(Mask))))
#define GPIOC_INTFLAG_CLR(Mask)                 ((CW_GPIOC->ICR) = (~((uint32_t)(Mask))))
#define GPIOF_INTFLAG_CLR(Mask)                 ((CW_GPIOF->ICR) = (~((uint32_t)(Mask))))

//============================================================
//ANALOG OR DIGTAL
#define PA00_DIGTAL_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN0  = 0)
#define PA00_ANALOG_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN0  = 1)
#define PA01_DIGTAL_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN1  = 0)
#define PA01_ANALOG_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN1  = 1)
#define PA02_DIGTAL_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN2  = 0)
#define PA02_ANALOG_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN2  = 1)
#define PA03_DIGTAL_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN3  = 0)
#define PA03_ANALOG_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN3  = 1)
#define PA04_DIGTAL_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN4  = 0)
#define PA04_ANALOG_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN4  = 1)
#define PA05_DIGTAL_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN5  = 0)
#define PA05_ANALOG_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN5  = 1)
#define PA06_DIGTAL_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN6  = 0)
#define PA06_ANALOG_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN6  = 1)
#define PA07_DIGTAL_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN7  = 0)
#define PA07_ANALOG_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN7  = 1)
#define PA08_DIGTAL_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN8  = 0)
#define PA08_ANALOG_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN8  = 1)
#define PA09_DIGTAL_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN9  = 0)
#define PA09_ANALOG_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN9  = 1)
#define PA10_DIGTAL_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN10 = 0)
#define PA10_ANALOG_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN10 = 1)
#define PA11_DIGTAL_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN11 = 0)
#define PA11_ANALOG_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN11 = 1)
#define PA12_DIGTAL_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN12 = 0)
#define PA12_ANALOG_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN12 = 1)
#define PA13_DIGTAL_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN13 = 0)
#define PA13_ANALOG_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN13 = 1)
#define PA14_DIGTAL_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN14 = 0)
#define PA14_ANALOG_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN14 = 1)
#define PA15_DIGTAL_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN15 = 0)
#define PA15_ANALOG_ENABLE()                    (CW_GPIOA->ANALOG_f.PIN15 = 1)
#define PB00_DIGTAL_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN0  = 0)
#define PB00_ANALOG_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN0  = 1)
#define PB01_DIGTAL_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN1  = 0)
#define PB01_ANALOG_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN1  = 1)
#define PB02_DIGTAL_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN2  = 0)
#define PB02_ANALOG_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN2  = 1)
#define PB03_DIGTAL_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN3  = 0)
#define PB03_ANALOG_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN3  = 1)
#define PB04_DIGTAL_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN4  = 0)
#define PB04_ANALOG_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN4  = 1)
#define PB05_DIGTAL_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN5  = 0)
#define PB05_ANALOG_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN5  = 1)
#define PB06_DIGTAL_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN6  = 0)
#define PB06_ANALOG_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN6  = 1)
#define PB07_DIGTAL_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN7  = 0)
#define PB07_ANALOG_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN7  = 1)
#define PB08_DIGTAL_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN8  = 0)
#define PB08_ANALOG_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN8  = 1)
#define PB09_DIGTAL_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN9  = 0)
#define PB09_ANALOG_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN9  = 1)
#define PB10_DIGTAL_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN10 = 0)
#define PB10_ANALOG_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN10 = 1)
#define PB11_DIGTAL_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN11 = 0)
#define PB11_ANALOG_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN11 = 1)
#define PB12_DIGTAL_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN12 = 0)
#define PB12_ANALOG_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN12 = 1)
#define PB13_DIGTAL_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN13 = 0)
#define PB13_ANALOG_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN13 = 1)
#define PB14_DIGTAL_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN14 = 0)
#define PB14_ANALOG_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN14 = 1)
#define PB15_DIGTAL_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN15 = 0)
#define PB15_ANALOG_ENABLE()                    (CW_GPIOB->ANALOG_f.PIN15 = 1)
#define PC13_DIGTAL_ENABLE()                    (CW_GPIOC->ANALOG_f.PIN13 = 0)
#define PC13_ANALOG_ENABLE()                    (CW_GPIOC->ANALOG_f.PIN13 = 1)
#define PC14_DIGTAL_ENABLE()                    (CW_GPIOC->ANALOG_f.PIN14 = 0)
#define PC14_ANALOG_ENABLE()                    (CW_GPIOC->ANALOG_f.PIN14 = 1)
#define PC15_DIGTAL_ENABLE()                    (CW_GPIOC->ANALOG_f.PIN15 = 0)
#define PC15_ANALOG_ENABLE()                    (CW_GPIOC->ANALOG_f.PIN15 = 1)
#define PF00_DIGTAL_ENABLE()                    (CW_GPIOF->ANALOG_f.PIN0  = 0)
#define PF00_ANALOG_ENABLE()                    (CW_GPIOF->ANALOG_f.PIN0  = 1)
#define PF01_DIGTAL_ENABLE()                    (CW_GPIOF->ANALOG_f.PIN1  = 0)
#define PF01_ANALOG_ENABLE()                    (CW_GPIOF->ANALOG_f.PIN1  = 1)
#define PF06_DIGTAL_ENABLE()                    (CW_GPIOF->ANALOG_f.PIN6  = 0)
#define PF06_ANALOG_ENABLE()                    (CW_GPIOF->ANALOG_f.PIN6  = 1)
#define PF07_DIGTAL_ENABLE()                    (CW_GPIOF->ANALOG_f.PIN7  = 0)
#define PF07_ANALOG_ENABLE()                    (CW_GPIOF->ANALOG_f.PIN7  = 1)
#define PF03_DIGTAL_ENABLE()                    (CW_GPIOF->ANALOG_f.PIN3  = 0)
#define PF03_ANALOG_ENABLE()                    (CW_GPIOF->ANALOG_f.PIN3  = 1)

//============================================================
// INPUTAND OUTPUT
#define PA00_DIR_OUTPUT()                       (CW_GPIOA->DIR_f.PIN0  = 0)
#define PA00_DIR_INPUT()                        (CW_GPIOA->DIR_f.PIN0  = 1)
#define PA01_DIR_OUTPUT()                       (CW_GPIOA->DIR_f.PIN1  = 0)
#define PA01_DIR_INPUT()                        (CW_GPIOA->DIR_f.PIN1  = 1)
#define PA02_DIR_OUTPUT()                       (CW_GPIOA->DIR_f.PIN2  = 0)
#define PA02_DIR_INPUT()                        (CW_GPIOA->DIR_f.PIN2  = 1)
#define PA03_DIR_OUTPUT()                       (CW_GPIOA->DIR_f.PIN3  = 0)
#define PA03_DIR_INPUT()                        (CW_GPIOA->DIR_f.PIN3  = 1)
#define PA04_DIR_OUTPUT()                       (CW_GPIOA->DIR_f.PIN4  = 0)
#define PA04_DIR_INPUT()                        (CW_GPIOA->DIR_f.PIN4  = 1)
#define PA05_DIR_OUTPUT()                       (CW_GPIOA->DIR_f.PIN5  = 0)
#define PA05_DIR_INPUT()                        (CW_GPIOA->DIR_f.PIN5  = 1)
#define PA06_DIR_OUTPUT()                       (CW_GPIOA->DIR_f.PIN6  = 0)
#define PA06_DIR_INPUT()                        (CW_GPIOA->DIR_f.PIN6  = 1)
#define PA07_DIR_OUTPUT()                       (CW_GPIOA->DIR_f.PIN7  = 0)
#define PA07_DIR_INPUT()                        (CW_GPIOA->DIR_f.PIN7  = 1)
#define PA08_DIR_OUTPUT()                       (CW_GPIOA->DIR_f.PIN8  = 0)
#define PA08_DIR_INPUT()                        (CW_GPIOA->DIR_f.PIN8  = 1)
#define PA09_DIR_OUTPUT()                       (CW_GPIOA->DIR_f.PIN9  = 0)
#define PA09_DIR_INPUT()                        (CW_GPIOA->DIR_f.PIN9  = 1)
#define PA10_DIR_OUTPUT()                       (CW_GPIOA->DIR_f.PIN10 = 0)
#define PA10_DIR_INPUT()                        (CW_GPIOA->DIR_f.PIN10 = 1)
#define PA11_DIR_OUTPUT()                       (CW_GPIOA->DIR_f.PIN11 = 0)
#define PA11_DIR_INPUT()                        (CW_GPIOA->DIR_f.PIN11 = 1)
#define PA12_DIR_OUTPUT()                       (CW_GPIOA->DIR_f.PIN12 = 0)
#define PA12_DIR_INPUT()                        (CW_GPIOA->DIR_f.PIN12 = 1)
#define PA13_DIR_OUTPUT()                       (CW_GPIOA->DIR_f.PIN13 = 0)
#define PA13_DIR_INPUT()                        (CW_GPIOA->DIR_f.PIN13 = 1)
#define PA14_DIR_OUTPUT()                       (CW_GPIOA->DIR_f.PIN14 = 0)
#define PA14_DIR_INPUT()                        (CW_GPIOA->DIR_f.PIN14 = 1)
#define PA15_DIR_OUTPUT()                       (CW_GPIOA->DIR_f.PIN15 = 0)
#define PA15_DIR_INPUT()                        (CW_GPIOA->DIR_f.PIN15 = 1)
#define PB00_DIR_OUTPUT()                       (CW_GPIOB->DIR_f.PIN0  = 0)
#define PB00_DIR_INPUT()                        (CW_GPIOB->DIR_f.PIN0  = 1)
#define PB01_DIR_OUTPUT()                       (CW_GPIOB->DIR_f.PIN1  = 0)
#define PB01_DIR_INPUT()                        (CW_GPIOB->DIR_f.PIN1  = 1)
#define PB02_DIR_OUTPUT()                       (CW_GPIOB->DIR_f.PIN2  = 0)
#define PB02_DIR_INPUT()                        (CW_GPIOB->DIR_f.PIN2  = 1)
#define PB03_DIR_OUTPUT()                       (CW_GPIOB->DIR_f.PIN3  = 0)
#define PB03_DIR_INPUT()                        (CW_GPIOB->DIR_f.PIN3  = 1)
#define PB04_DIR_OUTPUT()                       (CW_GPIOB->DIR_f.PIN4  = 0)
#define PB04_DIR_INPUT()                        (CW_GPIOB->DIR_f.PIN4  = 1)
#define PB05_DIR_OUTPUT()                       (CW_GPIOB->DIR_f.PIN5  = 0)
#define PB05_DIR_INPUT()                        (CW_GPIOB->DIR_f.PIN5  = 1)
#define PB06_DIR_OUTPUT()                       (CW_GPIOB->DIR_f.PIN6  = 0)
#define PB06_DIR_INPUT()                        (CW_GPIOB->DIR_f.PIN6  = 1)
#define PB07_DIR_OUTPUT()                       (CW_GPIOB->DIR_f.PIN7  = 0)
#define PB07_DIR_INPUT()                        (CW_GPIOB->DIR_f.PIN7  = 1)
#define PB08_DIR_OUTPUT()                       (CW_GPIOB->DIR_f.PIN8  = 0)
#define PB08_DIR_INPUT()                        (CW_GPIOB->DIR_f.PIN8  = 1)
#define PB09_DIR_OUTPUT()                       (CW_GPIOB->DIR_f.PIN9  = 0)
#define PB09_DIR_INPUT()                        (CW_GPIOB->DIR_f.PIN9  = 1)
#define PB10_DIR_OUTPUT()                       (CW_GPIOB->DIR_f.PIN10 = 0)
#define PB10_DIR_INPUT()                        (CW_GPIOB->DIR_f.PIN10 = 1)
#define PB11_DIR_OUTPUT()                       (CW_GPIOB->DIR_f.PIN11 = 0)
#define PB11_DIR_INPUT()                        (CW_GPIOB->DIR_f.PIN11 = 1)
#define PB12_DIR_OUTPUT()                       (CW_GPIOB->DIR_f.PIN12 = 0)
#define PB12_DIR_INPUT()                        (CW_GPIOB->DIR_f.PIN12 = 1)
#define PB13_DIR_OUTPUT()                       (CW_GPIOB->DIR_f.PIN13 = 0)
#define PB13_DIR_INPUT()                        (CW_GPIOB->DIR_f.PIN13 = 1)
#define PB14_DIR_OUTPUT()                       (CW_GPIOB->DIR_f.PIN14 = 0)
#define PB14_DIR_INPUT()                        (CW_GPIOB->DIR_f.PIN14 = 1)
#define PB15_DIR_OUTPUT()                       (CW_GPIOB->DIR_f.PIN15 = 0)
#define PB15_DIR_INPUT()                        (CW_GPIOB->DIR_f.PIN15 = 1)
#define PC13_DIR_OUTPUT()                       (CW_GPIOC->DIR_f.PIN13 = 0)
#define PC13_DIR_INPUT()                        (CW_GPIOC->DIR_f.PIN13 = 1)
#define PC14_DIR_OUTPUT()                       (CW_GPIOC->DIR_f.PIN14 = 0)
#define PC14_DIR_INPUT()                        (CW_GPIOC->DIR_f.PIN14 = 1)
#define PC15_DIR_OUTPUT()                       (CW_GPIOC->DIR_f.PIN15 = 0)
#define PC15_DIR_INPUT()                        (CW_GPIOC->DIR_f.PIN15 = 1)
#define PF00_DIR_OUTPUT()                       (CW_GPIOF->DIR_f.PIN0  = 0)
#define PF00_DIR_INPUT()                        (CW_GPIOF->DIR_f.PIN0  = 1)
#define PF01_DIR_OUTPUT()                       (CW_GPIOF->DIR_f.PIN1  = 0)
#define PF01_DIR_INPUT()                        (CW_GPIOF->DIR_f.PIN1  = 1)
#define PF06_DIR_OUTPUT()                       (CW_GPIOF->DIR_f.PIN6  = 0)
#define PF06_DIR_INPUT()                        (CW_GPIOF->DIR_f.PIN6  = 1)
#define PF07_DIR_OUTPUT()                       (CW_GPIOF->DIR_f.PIN7  = 0)
#define PF07_DIR_INPUT()                        (CW_GPIOF->DIR_f.PIN7  = 1)
#define PF03_DIR_OUTPUT()                       (CW_GPIOF->DIR_f.PIN3  = 0)
#define PF03_DIR_INPUT()                        (CW_GPIOF->DIR_f.PIN3  = 1)

