rushairer/LearnCW32/Libraries/inc/cw32f030_gpio.h
//============================================================
//push-pull or opendrain
#define PA00_PUSHPULL_ENABLE()                  (CW_GPIOA->OPENDRAIN_f.PIN0  = 0)
#define PA00_OPENDRAIN_ENABLE()                 (CW_GPIOA->OPENDRAIN_f.PIN0  = 1)
#define PA01_PUSHPULL_ENABLE()                  (CW_GPIOA->OPENDRAIN_f.PIN1  = 0)
#define PA01_OPENDRAIN_ENABLE()                 (CW_GPIOA->OPENDRAIN_f.PIN1  = 1)
#define PA02_PUSHPULL_ENABLE()                  (CW_GPIOA->OPENDRAIN_f.PIN2  = 0)
#define PA02_OPENDRAIN_ENABLE()                 (CW_GPIOA->OPENDRAIN_f.PIN2  = 1)
#define PA03_PUSHPULL_ENABLE()                  (CW_GPIOA->OPENDRAIN_f.PIN3  = 0)
#define PA03_OPENDRAIN_ENABLE()                 (CW_GPIOA->OPENDRAIN_f.PIN3  = 1)
#define PA04_PUSHPULL_ENABLE()                  (CW_GPIOA->OPENDRAIN_f.PIN4  = 0)
#define PA04_OPENDRAIN_ENABLE()                 (CW_GPIOA->OPENDRAIN_f.PIN4  = 1)
#define PA05_PUSHPULL_ENABLE()                  (CW_GPIOA->OPENDRAIN_f.PIN5  = 0)
#define PA05_OPENDRAIN_ENABLE()                 (CW_GPIOA->OPENDRAIN_f.PIN5  = 1)
#define PA06_PUSHPULL_ENABLE()                  (CW_GPIOA->OPENDRAIN_f.PIN6  = 0)
#define PA06_OPENDRAIN_ENABLE()                 (CW_GPIOA->OPENDRAIN_f.PIN6  = 1)
#define PA07_PUSHPULL_ENABLE()                  (CW_GPIOA->OPENDRAIN_f.PIN7  = 0)
#define PA07_OPENDRAIN_ENABLE()                 (CW_GPIOA->OPENDRAIN_f.PIN7  = 1)
#define PA08_PUSHPULL_ENABLE()                  (CW_GPIOA->OPENDRAIN_f.PIN8  = 0)
#define PA08_OPENDRAIN_ENABLE()                 (CW_GPIOA->OPENDRAIN_f.PIN8  = 1)
#define PA09_PUSHPULL_ENABLE()                  (CW_GPIOA->OPENDRAIN_f.PIN9  = 0)
#define PA09_OPENDRAIN_ENABLE()                 (CW_GPIOA->OPENDRAIN_f.PIN9  = 1)
#define PA10_PUSHPULL_ENABLE()                  (CW_GPIOA->OPENDRAIN_f.PIN10 = 0)
#define PA10_OPENDRAIN_ENABLE()                 (CW_GPIOA->OPENDRAIN_f.PIN10 = 1)
#define PA11_PUSHPULL_ENABLE()                  (CW_GPIOA->OPENDRAIN_f.PIN11 = 0)
#define PA11_OPENDRAIN_ENABLE()                 (CW_GPIOA->OPENDRAIN_f.PIN11 = 1)
#define PA12_PUSHPULL_ENABLE()                  (CW_GPIOA->OPENDRAIN_f.PIN12 = 0)
#define PA12_OPENDRAIN_ENABLE()                 (CW_GPIOA->OPENDRAIN_f.PIN12 = 1)
#define PA13_PUSHPULL_ENABLE()                  (CW_GPIOA->OPENDRAIN_f.PIN13 = 0)
#define PA13_OPENDRAIN_ENABLE()                 (CW_GPIOA->OPENDRAIN_f.PIN13 = 1)
#define PA14_PUSHPULL_ENABLE()                  (CW_GPIOA->OPENDRAIN_f.PIN14 = 0)
#define PA14_OPENDRAIN_ENABLE()                 (CW_GPIOA->OPENDRAIN_f.PIN14 = 1)
#define PA15_PUSHPULL_ENABLE()                  (CW_GPIOA->OPENDRAIN_f.PIN15 = 0)
#define PA15_OPENDRAIN_ENABLE()                 (CW_GPIOA->OPENDRAIN_f.PIN15 = 1)
#define PB00_PUSHPULL_ENABLE()                  (CW_GPIOB->OPENDRAIN_f.PIN0  = 0)
#define PB00_OPENDRAIN_ENABLE()                 (CW_GPIOB->OPENDRAIN_f.PIN0  = 1)
#define PB01_PUSHPULL_ENABLE()                  (CW_GPIOB->OPENDRAIN_f.PIN1  = 0)
#define PB01_OPENDRAIN_ENABLE()                 (CW_GPIOB->OPENDRAIN_f.PIN1  = 1)
#define PB02_PUSHPULL_ENABLE()                  (CW_GPIOB->OPENDRAIN_f.PIN2  = 0)
#define PB02_OPENDRAIN_ENABLE()                 (CW_GPIOB->OPENDRAIN_f.PIN2  = 1)
#define PB03_PUSHPULL_ENABLE()                  (CW_GPIOB->OPENDRAIN_f.PIN3  = 0)
#define PB03_OPENDRAIN_ENABLE()                 (CW_GPIOB->OPENDRAIN_f.PIN3  = 1)
#define PB04_PUSHPULL_ENABLE()                  (CW_GPIOB->OPENDRAIN_f.PIN4  = 0)
#define PB04_OPENDRAIN_ENABLE()                 (CW_GPIOB->OPENDRAIN_f.PIN4  = 1)
#define PB05_PUSHPULL_ENABLE()                  (CW_GPIOB->OPENDRAIN_f.PIN5  = 0)
#define PB05_OPENDRAIN_ENABLE()                 (CW_GPIOB->OPENDRAIN_f.PIN5  = 1)
#define PB06_PUSHPULL_ENABLE()                  (CW_GPIOB->OPENDRAIN_f.PIN6  = 0)
#define PB06_OPENDRAIN_ENABLE()                 (CW_GPIOB->OPENDRAIN_f.PIN6  = 1)
#define PB07_PUSHPULL_ENABLE()                  (CW_GPIOB->OPENDRAIN_f.PIN7  = 0)
#define PB07_OPENDRAIN_ENABLE()                 (CW_GPIOB->OPENDRAIN_f.PIN7  = 1)
#define PB08_PUSHPULL_ENABLE()                  (CW_GPIOB->OPENDRAIN_f.PIN8  = 0)
#define PB08_OPENDRAIN_ENABLE()                 (CW_GPIOB->OPENDRAIN_f.PIN8  = 1)
#define PB09_PUSHPULL_ENABLE()                  (CW_GPIOB->OPENDRAIN_f.PIN9  = 0)
#define PB09_OPENDRAIN_ENABLE()                 (CW_GPIOB->OPENDRAIN_f.PIN9  = 1)
#define PB10_PUSHPULL_ENABLE()                  (CW_GPIOB->OPENDRAIN_f.PIN10 = 0)
#define PB10_OPENDRAIN_ENABLE()                 (CW_GPIOB->OPENDRAIN_f.PIN10 = 1)
#define PB11_PUSHPULL_ENABLE()                  (CW_GPIOB->OPENDRAIN_f.PIN11 = 0)
#define PB11_OPENDRAIN_ENABLE()                 (CW_GPIOB->OPENDRAIN_f.PIN11 = 1)
#define PB12_PUSHPULL_ENABLE()                  (CW_GPIOB->OPENDRAIN_f.PIN12 = 0)
#define PB12_OPENDRAIN_ENABLE()                 (CW_GPIOB->OPENDRAIN_f.PIN12 = 1)
#define PB13_PUSHPULL_ENABLE()                  (CW_GPIOB->OPENDRAIN_f.PIN13 = 0)
#define PB13_OPENDRAIN_ENABLE()                 (CW_GPIOB->OPENDRAIN_f.PIN13 = 1)
#define PB14_PUSHPULL_ENABLE()                  (CW_GPIOB->OPENDRAIN_f.PIN14 = 0)
#define PB14_OPENDRAIN_ENABLE()                 (CW_GPIOB->OPENDRAIN_f.PIN14 = 1)
#define PB15_PUSHPULL_ENABLE()                  (CW_GPIOB->OPENDRAIN_f.PIN15 = 0)
#define PB15_OPENDRAIN_ENABLE()                 (CW_GPIOB->OPENDRAIN_f.PIN15 = 1)
#define PC13_PUSHPULL_ENABLE()                  (CW_GPIOC->OPENDRAIN_f.PIN13 = 0)
#define PC13_OPENDRAIN_ENABLE()                 (CW_GPIOC->OPENDRAIN_f.PIN13 = 1)
#define PC14_PUSHPULL_ENABLE()                  (CW_GPIOC->OPENDRAIN_f.PIN14 = 0)
#define PC14_OPENDRAIN_ENABLE()                 (CW_GPIOC->OPENDRAIN_f.PIN14 = 1)
#define PC15_PUSHPULL_ENABLE()                  (CW_GPIOC->OPENDRAIN_f.PIN15 = 0)
#define PC15_OPENDRAIN_ENABLE()                 (CW_GPIOC->OPENDRAIN_f.PIN15 = 1)
#define PF00_PUSHPULL_ENABLE()                  (CW_GPIOF->OPENDRAIN_f.PIN0  = 0)
#define PF00_OPENDRAIN_ENABLE()                 (CW_GPIOF->OPENDRAIN_f.PIN0  = 1)
#define PF01_PUSHPULL_ENABLE()                  (CW_GPIOF->OPENDRAIN_f.PIN1  = 0)
#define PF01_OPENDRAIN_ENABLE()                 (CW_GPIOF->OPENDRAIN_f.PIN1  = 1)
#define PF06_PUSHPULL_ENABLE()                  (CW_GPIOF->OPENDRAIN_f.PIN6  = 0)
#define PF06_OPENDRAIN_ENABLE()                 (CW_GPIOF->OPENDRAIN_f.PIN6  = 1)
#define PF07_PUSHPULL_ENABLE()                  (CW_GPIOF->OPENDRAIN_f.PIN7  = 0)
#define PF07_OPENDRAIN_ENABLE()                 (CW_GPIOF->OPENDRAIN_f.PIN7  = 1)
#define PF03_PUSHPULL_ENABLE()                  (CW_GPIOF->OPENDRAIN_f.PIN3  = 0)
#define PF03_OPENDRAIN_ENABLE()                 (CW_GPIOF->OPENDRAIN_f.PIN3  = 1)

//============================================================
// SPEED
#define PA00_SPEED_LOW()                        (CW_GPIOA->SPEED_f.PIN0  = 0)
#define PA00_SPEED_HIGH()                       (CW_GPIOA->SPEED_f.PIN0  = 1)
#define PA01_SPEED_LOW()                        (CW_GPIOA->SPEED_f.PIN1  = 0)
#define PA01_SPEED_HIGH()                       (CW_GPIOA->SPEED_f.PIN1  = 1)
#define PA02_SPEED_LOW()                        (CW_GPIOA->SPEED_f.PIN2  = 0)
#define PA02_SPEED_HIGH()                       (CW_GPIOA->SPEED_f.PIN2  = 1)
#define PA03_SPEED_LOW()                        (CW_GPIOA->SPEED_f.PIN3  = 0)
#define PA03_SPEED_HIGH()                       (CW_GPIOA->SPEED_f.PIN3  = 1)
#define PA04_SPEED_LOW()                        (CW_GPIOA->SPEED_f.PIN4  = 0)
#define PA04_SPEED_HIGH()                       (CW_GPIOA->SPEED_f.PIN4  = 1)
#define PA05_SPEED_LOW()                        (CW_GPIOA->SPEED_f.PIN5  = 0)
#define PA05_SPEED_HIGH()                       (CW_GPIOA->SPEED_f.PIN5  = 1)
#define PA06_SPEED_LOW()                        (CW_GPIOA->SPEED_f.PIN6  = 0)
#define PA06_SPEED_HIGH()                       (CW_GPIOA->SPEED_f.PIN6  = 1)
#define PA07_SPEED_LOW()                        (CW_GPIOA->SPEED_f.PIN7  = 0)
#define PA07_SPEED_HIGH()                       (CW_GPIOA->SPEED_f.PIN7  = 1)
#define PA08_SPEED_LOW()                        (CW_GPIOA->SPEED_f.PIN8  = 0)
#define PA08_SPEED_HIGH()                       (CW_GPIOA->SPEED_f.PIN8  = 1)
#define PA09_SPEED_LOW()                        (CW_GPIOA->SPEED_f.PIN9  = 0)
#define PA09_SPEED_HIGH()                       (CW_GPIOA->SPEED_f.PIN9  = 1)
#define PA10_SPEED_LOW()                        (CW_GPIOA->SPEED_f.PIN10 = 0)
#define PA10_SPEED_HIGH()                       (CW_GPIOA->SPEED_f.PIN10 = 1)
#define PA11_SPEED_LOW()                        (CW_GPIOA->SPEED_f.PIN11 = 0)
#define PA11_SPEED_HIGH()                       (CW_GPIOA->SPEED_f.PIN11 = 1)
#define PA12_SPEED_LOW()                        (CW_GPIOA->SPEED_f.PIN12 = 0)
#define PA12_SPEED_HIGH()                       (CW_GPIOA->SPEED_f.PIN12 = 1)
#define PA13_SPEED_LOW()                        (CW_GPIOA->SPEED_f.PIN13 = 0)
#define PA13_SPEED_HIGH()                       (CW_GPIOA->SPEED_f.PIN13 = 1)
#define PA14_SPEED_LOW()                        (CW_GPIOA->SPEED_f.PIN14 = 0)
#define PA14_SPEED_HIGH()                       (CW_GPIOA->SPEED_f.PIN14 = 1)
#define PA15_SPEED_LOW()                        (CW_GPIOA->SPEED_f.PIN15 = 0)
#define PA15_SPEED_HIGH()                       (CW_GPIOA->SPEED_f.PIN15 = 1)
#define PB00_SPEED_LOW()                        (CW_GPIOB->SPEED_f.PIN0  = 0)
#define PB00_SPEED_HIGH()                       (CW_GPIOB->SPEED_f.PIN0  = 1)
#define PB01_SPEED_LOW()                        (CW_GPIOB->SPEED_f.PIN1  = 0)
#define PB01_SPEED_HIGH()                       (CW_GPIOB->SPEED_f.PIN1  = 1)
#define PB02_SPEED_LOW()                        (CW_GPIOB->SPEED_f.PIN2  = 0)
#define PB02_SPEED_HIGH()                       (CW_GPIOB->SPEED_f.PIN2  = 1)
#define PB03_SPEED_LOW()                        (CW_GPIOB->SPEED_f.PIN3  = 0)
#define PB03_SPEED_HIGH()                       (CW_GPIOB->SPEED_f.PIN3  = 1)
#define PB04_SPEED_LOW()                        (CW_GPIOB->SPEED_f.PIN4  = 0)
#define PB04_SPEED_HIGH()                       (CW_GPIOB->SPEED_f.PIN4  = 1)
#define PB05_SPEED_LOW()                        (CW_GPIOB->SPEED_f.PIN5  = 0)
#define PB05_SPEED_HIGH()                       (CW_GPIOB->SPEED_f.PIN5  = 1)
#define PB06_SPEED_LOW()                        (CW_GPIOB->SPEED_f.PIN6  = 0)
#define PB06_SPEED_HIGH()                       (CW_GPIOB->SPEED_f.PIN6  = 1)
#define PB07_SPEED_LOW()                        (CW_GPIOB->SPEED_f.PIN7  = 0)
#define PB07_SPEED_HIGH()                       (CW_GPIOB->SPEED_f.PIN7  = 1)
#define PB08_SPEED_LOW()                        (CW_GPIOB->SPEED_f.PIN8  = 0)
#define PB08_SPEED_HIGH()                       (CW_GPIOB->SPEED_f.PIN8  = 1)
#define PB09_SPEED_LOW()                        (CW_GPIOB->SPEED_f.PIN9  = 0)
#define PB09_SPEED_HIGH()                       (CW_GPIOB->SPEED_f.PIN9  = 1)
#define PB10_SPEED_LOW()                        (CW_GPIOB->SPEED_f.PIN10 = 0)
#define PB10_SPEED_HIGH()                       (CW_GPIOB->SPEED_f.PIN10 = 1)
#define PB11_SPEED_LOW()                        (CW_GPIOB->SPEED_f.PIN11 = 0)
#define PB11_SPEED_HIGH()                       (CW_GPIOB->SPEED_f.PIN11 = 1)
#define PB12_SPEED_LOW()                        (CW_GPIOB->SPEED_f.PIN12 = 0)
#define PB12_SPEED_HIGH()                       (CW_GPIOB->SPEED_f.PIN12 = 1)
#define PB13_SPEED_LOW()                        (CW_GPIOB->SPEED_f.PIN13 = 0)
#define PB13_SPEED_HIGH()                       (CW_GPIOB->SPEED_f.PIN13 = 1)
#define PB14_SPEED_LOW()                        (CW_GPIOB->SPEED_f.PIN14 = 0)
#define PB14_SPEED_HIGH()                       (CW_GPIOB->SPEED_f.PIN14 = 1)
#define PB15_SPEED_LOW()                        (CW_GPIOB->SPEED_f.PIN15 = 0)
#define PB15_SPEED_HIGH()                       (CW_GPIOB->SPEED_f.PIN15 = 1)
#define PC13_SPEED_LOW()                        (CW_GPIOC->SPEED_f.PIN13 = 0)
#define PC13_SPEED_HIGH()                       (CW_GPIOC->SPEED_f.PIN13 = 1)
#define PC14_SPEED_LOW()                        (CW_GPIOC->SPEED_f.PIN14 = 0)
#define PC14_SPEED_HIGH()                       (CW_GPIOC->SPEED_f.PIN14 = 1)
#define PC15_SPEED_LOW()                        (CW_GPIOC->SPEED_f.PIN15 = 0)
#define PC15_SPEED_HIGH()                       (CW_GPIOC->SPEED_f.PIN15 = 1)
#define PF00_SPEED_LOW()                        (CW_GPIOF->SPEED_f.PIN0  = 0)
#define PF00_SPEED_HIGH()                       (CW_GPIOF->SPEED_f.PIN0  = 1)
#define PF01_SPEED_LOW()                        (CW_GPIOF->SPEED_f.PIN1  = 0)
#define PF01_SPEED_HIGH()                       (CW_GPIOF->SPEED_f.PIN1  = 1)
#define PF06_SPEED_LOW()                        (CW_GPIOF->SPEED_f.PIN6  = 0)
#define PF06_SPEED_HIGH()                       (CW_GPIOF->SPEED_f.PIN6  = 1)
#define PF07_SPEED_LOW()                        (CW_GPIOF->SPEED_f.PIN7  = 0)
#define PF07_SPEED_HIGH()                       (CW_GPIOF->SPEED_f.PIN7  = 1)
#define PF03_SPEED_LOW()                        (CW_GPIOF->SPEED_f.PIN3  = 0)
#define PF03_SPEED_HIGH()                       (CW_GPIOF->SPEED_f.PIN3  = 1)
//============================================================
//PUR
#define PA00_PUR_ENABLE()                       (CW_GPIOA->PUR_f.PIN0  = 1)
#define PA00_PUR_DISABLE()                      (CW_GPIOA->PUR_f.PIN0  = 0)
#define PA01_PUR_ENABLE()                       (CW_GPIOA->PUR_f.PIN1  = 1)
#define PA01_PUR_DISABLE()                      (CW_GPIOA->PUR_f.PIN1  = 0)
#define PA02_PUR_ENABLE()                       (CW_GPIOA->PUR_f.PIN2  = 1)
#define PA02_PUR_DISABLE()                      (CW_GPIOA->PUR_f.PIN2  = 0)
#define PA03_PUR_ENABLE()                       (CW_GPIOA->PUR_f.PIN3  = 1)
#define PA03_PUR_DISABLE()                      (CW_GPIOA->PUR_f.PIN3  = 0)
#define PA04_PUR_ENABLE()                       (CW_GPIOA->PUR_f.PIN4  = 1)
#define PA04_PUR_DISABLE()                      (CW_GPIOA->PUR_f.PIN4  = 0)
#define PA05_PUR_ENABLE()                       (CW_GPIOA->PUR_f.PIN5  = 1)
#define PA05_PUR_DISABLE()                      (CW_GPIOA->PUR_f.PIN5  = 0)
#define PA06_PUR_ENABLE()                       (CW_GPIOA->PUR_f.PIN6  = 1)
#define PA06_PUR_DISABLE()                      (CW_GPIOA->PUR_f.PIN6  = 0)
#define PA07_PUR_ENABLE()                       (CW_GPIOA->PUR_f.PIN7  = 1)
#define PA07_PUR_DISABLE()                      (CW_GPIOA->PUR_f.PIN7  = 0)
#define PA08_PUR_ENABLE()                       (CW_GPIOA->PUR_f.PIN8  = 1)
#define PA08_PUR_DISABLE()                      (CW_GPIOA->PUR_f.PIN8  = 0)
#define PA09_PUR_ENABLE()                       (CW_GPIOA->PUR_f.PIN9  = 1)
#define PA09_PUR_DISABLE()                      (CW_GPIOA->PUR_f.PIN9  = 0)
#define PA10_PUR_ENABLE()                       (CW_GPIOA->PUR_f.PIN10 = 1)
#define PA10_PUR_DISABLE()                      (CW_GPIOA->PUR_f.PIN10 = 0)
#define PA11_PUR_ENABLE()                       (CW_GPIOA->PUR_f.PIN11 = 1)
#define PA11_PUR_DISABLE()                      (CW_GPIOA->PUR_f.PIN11 = 0)
#define PA12_PUR_ENABLE()                       (CW_GPIOA->PUR_f.PIN12 = 1)
#define PA12_PUR_DISABLE()                      (CW_GPIOA->PUR_f.PIN12 = 0)
#define PA13_PUR_ENABLE()                       (CW_GPIOA->PUR_f.PIN13 = 1)
#define PA13_PUR_DISABLE()                      (CW_GPIOA->PUR_f.PIN13 = 0)
#define PA14_PUR_ENABLE()                       (CW_GPIOA->PUR_f.PIN14 = 1)
#define PA14_PUR_DISABLE()                      (CW_GPIOA->PUR_f.PIN14 = 0)
#define PA15_PUR_ENABLE()                       (CW_GPIOA->PUR_f.PIN15 = 1)
#define PA15_PUR_DISABLE()                      (CW_GPIOA->PUR_f.PIN15 = 0)
#define PB00_PUR_ENABLE()                       (CW_GPIOB->PUR_f.PIN0  = 1)
#define PB00_PUR_DISABLE()                      (CW_GPIOB->PUR_f.PIN0  = 0)
#define PB01_PUR_ENABLE()                       (CW_GPIOB->PUR_f.PIN1  = 1)
#define PB01_PUR_DISABLE()                      (CW_GPIOB->PUR_f.PIN1  = 0)
#define PB02_PUR_ENABLE()                       (CW_GPIOB->PUR_f.PIN2  = 1)
#define PB02_PUR_DISABLE()                      (CW_GPIOB->PUR_f.PIN2  = 0)
#define PB03_PUR_ENABLE()                       (CW_GPIOB->PUR_f.PIN3  = 1)
#define PB03_PUR_DISABLE()                      (CW_GPIOB->PUR_f.PIN3  = 0)
#define PB04_PUR_ENABLE()                       (CW_GPIOB->PUR_f.PIN4  = 1)
#define PB04_PUR_DISABLE()                      (CW_GPIOB->PUR_f.PIN4  = 0)
#define PB05_PUR_ENABLE()                       (CW_GPIOB->PUR_f.PIN5  = 1)
#define PB05_PUR_DISABLE()                      (CW_GPIOB->PUR_f.PIN5  = 0)
#define PB06_PUR_ENABLE()                       (CW_GPIOB->PUR_f.PIN6  = 1)
#define PB06_PUR_DISABLE()                      (CW_GPIOB->PUR_f.PIN6  = 0)
#define PB07_PUR_ENABLE()                       (CW_GPIOB->PUR_f.PIN7  = 1)
#define PB07_PUR_DISABLE()                      (CW_GPIOB->PUR_f.PIN7  = 0)
#define PB08_PUR_ENABLE()                       (CW_GPIOB->PUR_f.PIN8  = 1)
#define PB08_PUR_DISABLE()                      (CW_GPIOB->PUR_f.PIN8  = 0)
#define PB09_PUR_ENABLE()                       (CW_GPIOB->PUR_f.PIN9  = 1)
#define PB09_PUR_DISABLE()                      (CW_GPIOB->PUR_f.PIN9  = 0)
#define PB10_PUR_ENABLE()                       (CW_GPIOB->PUR_f.PIN10 = 1)
#define PB10_PUR_DISABLE()                      (CW_GPIOB->PUR_f.PIN10 = 0)
#define PB11_PUR_ENABLE()                       (CW_GPIOB->PUR_f.PIN11 = 1)
#define PB11_PUR_DISABLE()                      (CW_GPIOB->PUR_f.PIN11 = 0)
#define PB12_PUR_ENABLE()                       (CW_GPIOB->PUR_f.PIN12 = 1)
#define PB12_PUR_DISABLE()                      (CW_GPIOB->PUR_f.PIN12 = 0)
#define PB13_PUR_ENABLE()                       (CW_GPIOB->PUR_f.PIN13 = 1)
#define PB13_PUR_DISABLE()                      (CW_GPIOB->PUR_f.PIN13 = 0)
#define PB14_PUR_ENABLE()                       (CW_GPIOB->PUR_f.PIN14 = 1)
#define PB14_PUR_DISABLE()                      (CW_GPIOB->PUR_f.PIN14 = 0)
#define PB15_PUR_ENABLE()                       (CW_GPIOB->PUR_f.PIN15 = 1)
#define PB15_PUR_DISABLE()                      (CW_GPIOB->PUR_f.PIN15 = 0)
#define PC13_PUR_ENABLE()                       (CW_GPIOC->PUR_f.PIN13 = 1)
#define PC13_PUR_DISABLE()                      (CW_GPIOC->PUR_f.PIN13 = 0)
#define PC14_PUR_ENABLE()                       (CW_GPIOC->PUR_f.PIN14 = 1)
#define PC14_PUR_DISABLE()                      (CW_GPIOC->PUR_f.PIN14 = 0)
#define PC15_PUR_ENABLE()                       (CW_GPIOC->PUR_f.PIN15 = 1)
#define PC15_PUR_DISABLE()                      (CW_GPIOC->PUR_f.PIN15 = 0)
#define PF00_PUR_ENABLE()                       (CW_GPIOF->PUR_f.PIN0  = 1)
#define PF00_PUR_DISABLE()                      (CW_GPIOF->PUR_f.PIN0  = 0)
#define PF01_PUR_ENABLE()                       (CW_GPIOF->PUR_f.PIN1  = 1)
#define PF01_PUR_DISABLE()                      (CW_GPIOF->PUR_f.PIN1  = 0)
#define PF06_PUR_ENABLE()                       (CW_GPIOF->PUR_f.PIN6  = 1)
#define PF06_PUR_DISABLE()                      (CW_GPIOF->PUR_f.PIN6  = 0)
#define PF07_PUR_ENABLE()                       (CW_GPIOF->PUR_f.PIN7  = 1)
#define PF07_PUR_DISABLE()                      (CW_GPIOF->PUR_f.PIN7  = 0)
#define PF03_PUR_ENABLE()                       (CW_GPIOF->PUR_f.PIN3  = 1)
#define PF03_PUR_DISABLE()                      (CW_GPIOF->PUR_f.PIN3  = 0)

